# Modèle YOLOv5s adapté avec mécanisme GD pour ADYOLOv5-Face

# Paramètres
nc: 1  # nombre de classes (1 pour les visages)
depth_multiple: 0.33  # facteur pour la profondeur du modèle
width_multiple: 0.50  # facteur pour la largeur du modèle

# Anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
  - [5,6, 8,14, 16,12]  # P2/4 (ajouté pour les petits visages)

# YOLOv5s backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2 (remplacé Focus par Conv 6x6)
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],          # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],          # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],          # 6
   [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# Neck avec mécanisme Gather-and-Distribute (GD)
neck:
  [[-1, 1, Conv, [512, 1, 1]],  # 10 (P5/32)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11 (P5/32 → P4/16)
   [[-1, 6], 1, Concat, [1]],   # 12 Concat avec P4
   [-1, 3, C3, [512, False]],   # 13 (P4/16)
   
   [-1, 1, Conv, [256, 1, 1]],  # 14 (P4/16)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15 (P4/16 → P3/8)
   [[-1, 4], 1, Concat, [1]],   # 16 Concat avec P3
   [-1, 3, C3, [256, False]],   # 17 (P3/8)
   
   [-1, 1, Conv, [256, 3, 2]],  # 18 (P3/8 → P4/16)
   [[-1, 14], 1, Concat, [1]],  # 19 Concat avec 14 (P4/16)
   [-1, 3, C3, [512, False]],   # 20 (P4/16)
   
   [-1, 1, Conv, [512, 3, 2]],  # 21 (P4/16 → P5/32)
   [[-1, 10], 1, Concat, [1]],  # 22 Concat avec 10 (P5/32)
   [-1, 3, C3, [1024, False]],  # 23 (P5/32)

   # Ajout de l'implémentation GD complète (Low-Level et High-Level)
   [[17, 20, 23], 1, LowStageGD, [256]], # 24: GD Low-Level pour améliorer P3, P4, P5
   [[17, 20, 23], 1, HighStageGD, [512]], # 25: GD High-Level pour raffiner les features
  ]

# Head YOLOv5 avec amélioration pour petits visages
head:
  [# Tête pour petits visages (basée sur le mécanisme GD)
   [24, 1, Conv, [256, 3, 1]],  # 26: Traitement pour tête P3/8 (Low-GD)
   [25, 1, Conv, [256, 3, 1]],  # 27: Traitement pour tête P3/8 (High-GD)
   
   # Version avec 3 têtes standard (conserver la structure originale)
   [[17, 20, 23], 1, Detect, [nc, anchors]],  # 28: Détection standard
  ]
