# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5  # layer channel multiple

# anchors
anchors:
  - [4,5,  8,10,  13,16]  # P3/8
  - [23,29,  43,55,  73,105]  # P4/16
  - [146,217,  231,300,  335,433]  # P5/32
  - [4,5,  8,10,  13,16]  # P2/4 (pour les petits visages)

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, StemBlock, [64, 3, 2]],  # 0-P1/2
   [-1, 3, C3, [128]],              # 1
   [-1, 1, Conv, [256, 3, 2]],      # 2-P3/8
   [-1, 9, C3, [256]],              # 3
   [-1, 1, Conv, [512, 3, 2]],      # 4-P4/16
   [-1, 9, C3, [512]],              # 5
   [-1, 1, Conv, [1024, 3, 2]],     # 6-P5/32
   [-1, 1, SPP, [1024, [3,5,7]]],   # 7
   [-1, 3, C3, [1024, False]],      # 8

   # DÉBUT Mécanisme GD (Gather-and-Distribute)
   [-1, 1, Conv, [512, 1, 1]],                  # 9 (P5/32-reduced)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 10 (P5/32 -> P4/16)
   [5, 1, Conv, [512, 1, 1]],                   # 11 (P4/16-reduced)
   [[-1, -2], 1, GatherLayer, [512]],           # 12 (Gather P4 features)
   [-1, 3, C3, [512, False]],                   # 13 (GD-P4/16)
   
   [-1, 1, Conv, [256, 1, 1]],                  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15 (GD-P4/16 -> P3/8)
   [3, 1, Conv, [256, 1, 1]],                   # 16 (P3/8-reduced)
   [[-1, -2], 1, GatherLayer, [256]],           # 17 (Gather P3 features)
   [-1, 3, C3, [256, False]],                   # 18 (GD-P3/8)
   
   [-1, 1, Conv, [128, 1, 1]],                  # 19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 20 (GD-P3/8 -> P2/4)
   [1, 1, Conv, [128, 1, 1]],                   # 21 (P2/4-reduced)
   [[-1, -2], 1, GatherLayer, [128]],           # 22 (Gather P2 features)
   [-1, 3, C3, [128, False]],                   # 23 (GD-P2/4)
   
   # Phase de distribution (Distribute)
   [-1, 1, Conv, [256, 3, 2]],                  # 24 (GD-P2/4 -> P3/8-dist)
   [[-1, 18], 1, DistributeLayer, [256]],       # 25 (Distribute to P3/8)
   [-1, 3, C3, [256, False]],                   # 26 (GD-P3/8-dist)
   
   [-1, 1, Conv, [512, 3, 2]],                  # 27 (GD-P3/8 -> P4/16-dist)
   [[-1, 13], 1, DistributeLayer, [512]],       # 28 (Distribute to P4/16)
   [-1, 3, C3, [512, False]],                   # 29 (GD-P4/16-dist)
   
   [-1, 1, Conv, [1024, 3, 2]],                 # 30 (GD-P4/16 -> P5/32-dist)
   [[-1, 9], 1, DistributeLayer, [1024]],       # 31 (Distribute to P5/32)
   [-1, 3, C3, [1024, False]],                  # 32 (GD-P5/32-dist)
  ]

# YOLOv5 head
head:
  [
   [23, 1, Conv, [128, 3, 1]],                  # 33 (Detect P2/4 - petits visages)
   [-1, 1, nn.Conv2d, [16, 1, 1]],              # 34 (Output P2/4)
   
   [26, 1, Conv, [256, 3, 1]],                  # 35 (Detect P3/8)
   [-1, 1, nn.Conv2d, [16, 1, 1]],              # 36 (Output P3/8)

   [29, 1, Conv, [512, 3, 1]],                  # 37 (Detect P4/16)
   [-1, 1, nn.Conv2d, [16, 1, 1]],              # 38 (Output P4/16)
   
   [32, 1, Conv, [1024, 3, 1]],                 # 39 (Detect P5/32)
   [-1, 1, nn.Conv2d, [16, 1, 1]],              # 40 (Output P5/32)
   
   [[34, 36, 38, 40], 1, Detect, [nc, anchors]],  # 41 (Fusion des 4 têtes)
  ]