# Modèle YOLOv5s adapté avec mécanisme GD pour ADYOLOv5-Face

# Paramètres
nc: 1  # nombre de classes (1 pour les visages)
depth_multiple: 0.33  # facteur pour la profondeur du modèle
width_multiple: 0.50  # facteur pour la largeur du modèle

# Anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5s backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5s head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13
   
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3)
   
   # Ajout du mécanisme Gather-and-Distribute Low-Stage
   [[17, 13, 9], 1, LowStageGD, [256]],  # 18: GD pour P3, P4, P5
   
   [18, 1, Conv, [256, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  # cat P4
   [-1, 3, C3, [512, False]],  # 21 (P4)
   
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat P5
   [-1, 3, C3, [1024, False]],  # 24 (P5)
   
   # Ajout du mécanisme Gather-and-Distribute High-Stage
   [[18, 21, 24], 1, HighStageGD, [512]],  # 25: GD pour features améliorées
   
   # Têtes de détection: principale et petits visages
   [18, 1, Conv, [256, 3, 1]],  # 26: tête P3 pour petits visages
   [-1, 1, nn.Conv2d, [18, 1, 1]],  # 27: sortie pour petits visages (6 classes × 3 anchors × 5 box params + landmarks)
   
   [[18, 21, 24], 1, Detect, [nc, anchors]],  # 28: tête de détection principale
  ]
