# ADYOLOv5s architecture with Gather-and-Distribute mechanism
# Anchors
nc: 1  # number of classes (face only)
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# Anchors for 4 detection levels (P2/P3/P4/P5)
anchors:
  - [4, 5, 8, 10, 13, 16]  # P2/4 - small faces
  - [19, 36, 40, 28, 36, 75]  # P3/8
  - [76, 55, 72, 146, 142, 110]  # P4/16
  - [192, 243, 459, 401, 368, 539]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],  # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],  # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],  # 6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],  # 8
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head with Gather-and-Distribute
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],  # 12 cat with P4
   [-1, 3, C3, [512, False]],  # 13
   [-1, 1, Conv, [256, 1, 1]],  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, Concat, [1]],  # 16 cat with P3
   [-1, 3, C3, [256, False]],  # 17
   [-1, 1, Conv, [128, 1, 1]],  # 18 P2 pathway
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 19
   [[-1, 2], 1, Concat, [1]],  # 20 cat with P2
   [-1, 3, C3, [128, False]],  # 21 P2/4
   [17, 1, Conv, [256, 3, 2]],  # 22 P3->P4
   [[-1, 13], 1, GDFusion, [256, 'attention']],  # 23 Low-Stage P4
   [-1, 3, C3, [512, False]],  # 24
   [24, 1, Conv, [512, 3, 2]],  # 25 P4->P5
   [[-1, 10], 1, GDFusion, [512, 'attention']],  # 26 Low-Stage P5
   [-1, 3, C3, [1024, False]],  # 27
   [27, 1, Conv, [512, 1, 1]],  # 28 High-Stage start
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 29
   [[-1, 24], 1, GDFusion, [512, 'transformer']],  # 30 High-Stage P4
   [-1, 3, C3, [512, False]],  # 31
   [31, 1, Conv, [256, 1, 1]],  # 32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 33
   [[-1, 17], 1, GDFusion, [256, 'transformer']],  # 34 High-Stage P3
   [-1, 3, C3, [256, False]],  # 35
   [35, 1, Conv, [128, 1, 1]],  # 36
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 37
   [[-1, 21], 1, GDFusion, [128, 'transformer']],  # 38 High-Stage P2
   [-1, 3, C3, [128, False]],  # 39
   [39, 1, Conv, [128, 3, 1]],  # 40 P2 detection prep
   [35, 1, Conv, [256, 3, 1]],  # 41 P3 detection prep
   [31, 1, Conv, [512, 3, 1]],  # 42 P4 detection prep
   [27, 1, Conv, [1024, 3, 1]],  # 43 P5 detection prep
   [[40, 41, 42, 43], 1, Detect, [nc, anchors]],  # 44 Detection Head
  ]