# Modèle ADYOLOv5s - Implémentation fidèle à l'article

# Paramètres
nc: 1  # nombre de classes (1 pour les visages)
depth_multiple: 0.33  # facteur pour la profondeur du modèle
width_multiple: 0.50  # facteur pour la largeur du modèle

# Anchors - Standard 3 échelles + 1 échelle pour les petits visages
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
  - [5,6, 8,14, 16,12]  # P2/4 (ajouté pour les petits visages)

# CSPDarknet53 backbone (identique à l'article)
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],          # 2 
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],          # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],          # 6
   [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# Neck avec mécanisme Gather-and-Distribute (figure 2 de l'article)
head:
  # Feature Map Gathering (P5/32 -> P4/16 -> P3/8)
  [[-1, 1, Conv, [512, 1, 1]],      # 10 (P5/32)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11 (P5/32 → P4/16)
   [[-1, 6], 1, Concat, [1]],       # 12 Concat avec P4
   [-1, 3, C3, [512, False]],       # 13 (P4/16)
   
   [-1, 1, Conv, [256, 1, 1]],      # 14 (P4/16)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15 (P4/16 → P3/8)
   [[-1, 4], 1, Concat, [1]],       # 16 Concat avec P3
   [-1, 3, C3, [256, False]],       # 17 (P3/8)
   
   [-1, 1, Conv, [128, 1, 1]],      # 18 (P3/8)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 19 (P3/8 → P2/4)
   [[-1, 2], 1, Concat, [1]],       # 20 Concat avec P2
   [-1, 1, C3, [128, False]],       # 21 (P2/4) - Feature pour les TRÈS petits visages
   
   # Implémentation simplifiée du Low-Stage GD - Fusion et Injection
   [[17, 13, 10], 1, AttentionFusion, [256]], # 22: Global Low-Level Features
   
   # Partie descendante avec enrichissement des features
   # P2/4 -> P3/8 (avec Global Feature injection)
   [21, 1, Conv, [256, 3, 2]],      # 23 (P2/4 -> P3/8)
   [[-1, 17, 22], 1, Concat, [1]],  # 24 Fusion avec P3/8 et Global Features
   [-1, 3, C3, [256, False]],       # 25 (P3/8 enrichi)
   
   # P3/8 -> P4/16 (avec Global Feature injection)
   [-1, 1, Conv, [512, 3, 2]],      # 26 (P3/8 -> P4/16)
   [[-1, 13, 22], 1, Concat, [1]],  # 27 Fusion avec P4/16 et Global Features
   [-1, 3, C3, [512, False]],       # 28 (P4/16 enrichi)
   
   # P4/16 -> P5/32 (avec Global Feature injection)
   [-1, 1, Conv, [1024, 3, 2]],     # 29 (P4/16 -> P5/32)
   [[-1, 10, 22], 1, Concat, [1]],  # 30 Fusion avec P5/32 et Global Features
   [-1, 3, C3, [1024, False]],      # 31 (P5/32 enrichi)
   
   # Implémentation simplifiée du High-Stage GD - Transformer-like Fusion
   [[25, 28, 31], 1, TransformerFusion, [512]], # 32: High-Level Features avec mécanisme d'attention
   
   # Détection à 4 échelles (P2/4, P3/8, P4/16, P5/32) comme dans l'article
   [[21, 25, 28, 31], 1, Detect, [nc, anchors]], # 33: Détection aux 4 échelles
  ]
