# Modèle YOLOv5s adapté avec mécanisme GD pour ADYOLOv5-Face

# Paramètres
nc: 1  # nombre de classes (1 pour les visages)
depth_multiple: 0.33  # facteur pour la profondeur du modèle
width_multiple: 0.50  # facteur pour la largeur du modèle

# Anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
  - [5,6, 8,14, 16,12]  # P2/4 (ajouté pour les petits visages)

# YOLOv5s backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2 (remplacé Focus par Conv 6x6)
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# Neck avec mécanisme Gather-and-Distribute (GD)
neck:
  [[-1, 1, Conv, [512, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, GDFusion, [512, 'low']],  # 12 - Low-GD fusion pour P4
   [-1, 3, C3, [512, False]],  # 13
   [-1, 1, Conv, [256, 1, 1]],  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, GDFusion, [256, 'low']],  # 16 - Low-GD fusion pour P3
   [-1, 3, C3, [256, False]],  # 17
   [-1, 1, Conv, [128, 1, 1]],  # 18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 19
   [[-1, 2], 1, GDFusion, [128, 'low']],  # 20 - Low-GD fusion pour P2 (couche supplémentaire)
   [-1, 3, C3, [128, False]],  # 21
   
   # Route de P2 -> détection de minuscules visages
   [-1, 1, Conv, [256, 3, 2]],  # 22
   [[-1, 17], 1, GDFusion, [256, 'high']],  # 23 - High-GD fusion
   [-1, 3, C3, [256, False]],  # 24
   [-1, 1, Conv, [512, 3, 2]],  # 25
   [[-1, 13], 1, GDFusion, [512, 'high']],  # 26 - High-GD fusion
   [-1, 3, C3, [512, False]],  # 27
   [-1, 1, Conv, [1024, 3, 2]],  # 28
   [[-1, 9], 1, GDFusion, [1024, 'high']],  # 29 - High-GD fusion
   [-1, 3, C3, [1024, False]],  # 30
  ]

# Head YOLOv5 avec tête supplémentaire pour petits visages
head:
  [[[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Quatre têtes de détection au lieu de trois
  ]
